# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [ ]:
pip uninstall PyMySQL

In [ ]:
pip uninstall mysql

In [ ]:
pip uninstall mysql-connector

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\smgrl\anaconda3\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

### Connect to DB using Mysql-connector-python package

In [2]:
import mysql.connector
import pandas as pd

### You are required to create a database named 'e_commerce'

In [20]:
connection = mysql.connector.connect(user='root', password='ku@SMG98451',
                              host='localhost')
cursorObject = connection.cursor()
cursorObject.execute("create database e_commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [22]:
table_execution_query = "CREATE TABLE e_commerce.SUPPLIER (`SUPP_ID` int primary key, `SUPP_NAME` varchar(50), `SUPP_CITY` varchar(50), `SUPP_PHONE` varchar(10));"
cursorObject.execute(table_execution_query)

In [25]:
table_execution_query1 = "CREATE TABLE e_commerce.CUSTOMER  (`CUS_ID` INT NOT NULL, `CUS_NAME` VARCHAR(20) NULL DEFAULT NULL,`CUS_PHONE` VARCHAR(10), `CUS_CITY` varchar(30), `CUS_GENDER` CHAR,PRIMARY KEY (CUS_ID));"
cursorObject.execute(table_execution_query1)

In [27]:
table_execution_query1 = "CREATE TABLE e_commerce.CATEGORY (`CAT_ID` INT NOT NULL, `CAT_NAME` VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));"
cursorObject.execute(table_execution_query1)

In [28]:
table_execution_query1 = "CREATE TABLE e_commerce.PRODUCT (`PRO_ID` INT NOT NULL, `PRO_NAME` VARCHAR(20) NULL DEFAULT NULL,`PRO_DESC` VARCHAR(60) NULL DEFAULT NULL,`CAT_ID` INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));"
cursorObject.execute(table_execution_query1)

In [29]:
table_execution_query1 = "CREATE TABLE e_commerce.PRODUCT_DETAILS (`PROD_ID` INT NOT NULL, `PRO_ID` INT NOT NULL, `SUPP_ID` INT NOT NULL,`PROD_PRICE` INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));"
cursorObject.execute(table_execution_query1)

In [32]:
table_execution_query1 = "CREATE table e_commerce.ORDER (`ORD_ID` INT NOT NULL, `ORD_AMOUNT` INT NOT NULL, `ORD_DATE` DATE,`CUS_ID` INT NOT NULL, `PROD_ID` INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));"
cursorObject.execute(table_execution_query1)

In [33]:
table_execution_query1 = "CREATE table e_commerce.RATING (`RAT_ID` INT NOT NULL, `CUS_ID` INT NOT NULL, `SUPP_ID` INT NOT NULL,`RAT_RATSTARS` INT NOT NULL,PRIMARY KEY (RAT_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"
cursorObject.execute(table_execution_query1)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [50]:
insert_query = """INSERT INTO e_commerce.supplier( SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE ) values (%s %s %s %s) """

In [54]:
# insert into "supplier" table
val = [(1,'Rajesh Retails','Delhi','1234567890'),
       (2,'Appario Ltd.','Mumbai','258963147032'),
       (3,'Knome products','Bangalore','9785462315'),
       (4,'Bansal Retails','Kochi','8975463285'),
       (5,'Mittal Ltd.','Lucknow','7898456532')]

cursorObject.executemany(insert_query,val)
connection.commit()

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ''Rajesh Retails' 'Delhi' '1234567890'),(2 'Appario Ltd.' 'Mumbai' '258963147032'' at line 1

In [4]:
insert_query = """INSERT INTO e_commerce.supplier( SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE ) values (1,'Rajesh Retails','Delhi','1234567890'),(2,'Appario Ltd.','Mumbai','2583147032'),(3,'Knome products','Bangalore','9785462315'),(4,'Bansal Retails','Kochi','8975463285'),(5,'Mittal Ltd.','Lucknow','7898456532');"""
cursorObject.execute(insert_query)
connection.commit()

IntegrityError: 1062 (23000): Duplicate entry '1' for key 'supplier.PRIMARY'

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [6]:
insert_query = """INSERT INTO e_commerce.customer( CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER)
values (1,'AAKASH','1234567890','Delhi','M'),(2,'AMAN','9785463215','NOIDA','M'),(3,'NEHA','9999999998','MUMBAI','F'),
(4,'MEGHA','9994562399','KOLKATA','F'),(5,'PULKIT','7895999999','LUCKNOW','M');"""
cursorObject.execute(insert_query)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [8]:
insert_query = """INSERT INTO e_commerce.category( CAT_ID,CAT_NAME) values (1,'BOOKS'),(2,'GAMES'),(3,'GROCERIES'),(4,'ELECTRONICS'),(5,'CLOTHES');"""
cursorObject.execute(insert_query)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [9]:
insert_query = """INSERT INTO e_commerce.product( PRO_ID,PRO_NAME,PRO_DESC,CAT_ID) values (1,'GTA V','DFJDJFDJFDJFDJFJF',2),(2,'TSHIRT','DFDFJDFJDKFD',5),(3,'ROG LAPTOP','DFNTTNTNTERND',4),(4,'OATS','REURENTBTOTH',3),(5,'HARRY POTTER','NBEMCTHTJTH',1);"""
cursorObject.execute(insert_query)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [10]:
# insert into "product_details" table
insert_query = """INSERT INTO e_commerce.product_details(PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) values (1,1,2,1500),(2,3,5,30000),(3,5,1,3000),(4,2,3,2500),(5,4,1,1000);"""
cursorObject.execute(insert_query)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [12]:
# insert into "orders" table
insert_query = """INSERT INTO e_commerce.order(ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) values (20,1500,"2021-10-12",3,5),(2,30500,"2021-09-16",5,2),(3,2000,"2021-10-05",1,1),(4,3500,"2021-08-16",4,3),(50,2000,"2021-10-06",2,1);"""
cursorObject.execute(insert_query)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [13]:
# insert into "rating" table
insert_query = """INSERT INTO e_commerce.rating(RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) values (1,2,2,4),(2,3,4,3),(3,5,1,5),(4,1,3,2),(5,4,5,4);"""
cursorObject.execute(insert_query)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [35]:
connection = mysql.connector.connect(user='root', password='ku@SMG98451',
                              host='localhost',database='e_commerce')
cursorObject = connection.cursor()
Q3 = """ select customer.cus_gender,count(customer.cus_gender)as count from customer inner join `order` on customer.cus_id=`order`.cus_id where `order`.ord_amount>=3000 group by customer.cus_gender;"""
cursorObject.execute(Q3)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['CUS_GENDER','COUNT'])
output_df

  CUS_GENDER  COUNT
0          M      1
1          F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [37]:
Q4 = """select `order`.*, product.pro_name from `order`, product_details, product where `order`.cus_id=2 and `order`.prod_id=product_details.prod_id and product_details.pro_id=product.pro_id;"""
cursorObject.execute(Q4)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0      50        2000  2021-10-06       2        1    GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [38]:
Q5 = """select supplier.* from supplier, product_details where supplier.supp_id in (select product_details.supp_id from product_details group by product_details.supp_id having count(product_details.supp_id)>1) group by supplier.supp_id;"""
cursorObject.execute(Q5)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [40]:
Q6 = """select category.* from `order`inner join product_details on `order`.prod_id=product_details.prod_id inner join product on product.pro_id=product_details.pro_id inner join category on category.cat_id=product.cat_id having min(`order`.ord_amount);"""
cursorObject.execute(Q6)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['CAT_ID','CAT_NAME'])
output_df

   CAT_ID CAT_NAME
0       1    BOOKS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [41]:
Q7 = """select product.pro_id, product.pro_name from `order` inner join product_details on product_details.prod_id=`order`.prod_id inner join product on product.pro_id=product_details.pro_id where `order`.ord_date>"2021-10-05";"""
cursorObject.execute(Q7)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['PROD_ID','PROD_NAME'])
output_df

   PROD_ID PROD_NAME
0        4      OATS
1        1     GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [45]:
Q8 = """select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars from rating inner join supplier on rating.supp_id=supplier.supp_id inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;"""
cursorObject.execute(Q8)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['SUPP_ID','SUPP_NAME','CUS_NAME','RAT_RATSTARS'])
output_df

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [48]:
Q9 = """select customer.cus_name,customer.cus_gender from customer where customer.cus_name like 'A%' or customer.cus_name like '%A';"""
cursorObject.execute(Q9)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [49]:
Q10 = """select sum(`order`.ord_amount) as amount from `order` inner join customer on `order`.cus_id=customer.cus_id where customer.cus_gender='M';"""
cursorObject.execute(Q10)
output = cursorObject.fetchall()
print("Amount is",output)

Amount is [(Decimal('34500'),)]

### Q11) Display all the Customers left outer join with  the orders

In [51]:
Q11 = """select * from customer left outer join `order` on customer.cus_id=`order`.cus_id;"""
cursorObject.execute(Q11)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output,columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,1234567890,Delhi,M,3,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,4,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,2,30500,2021-09-16,5,2

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)